#Область ОбработчикиСобытий

//Представление Контактного лица В виде "<КонтактноеЛицо> (Действует на основании <ДействуетНаОсновании>)": объявление
//полей формирующих представление 
//Параметры:
//	Поля - Структура - КонтактноеЛицо, ДействуетНаОсновании
//	СтандартнаяОбработка - Булево - принимает значение Ложь 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

//Представление Контактного лица В виде "<КонтактноеЛицо> (Действует на основании <ДействуетНаОсновании>)": формирование строки
//Параметры:
//	Данные - Структура - КонтактноеЛицо, ДействуетНаОсновании
//	Представление - Строка - Строка-цель, сформированная в итоге
//	СтандартнаяОбработка - Булево - принимает значение Ложь, если заполнено поле ДействуетНаОсновании
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон("%1 (Действует на основании %2)", Данные.Наименование, Данные.ДействуетНаОсновании);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти